In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame()

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [15]:
df1 = pd.DataFrame([[1,2,3,34,5],[4,5,77,2,6],[7,8,9,4,2],[56,67,23,4,6],[87,3,5,7,5]], columns=['a','b','c','d',
                                                                                               'e'])

In [16]:
df1

    a   b   c   d  e
0   1   2   3  34  5
1   4   5  77   2  6
2   7   8   9   4  2
3  56  67  23   4  6
4  87   3   5   7  5

In [7]:
df1.head(3)

   0  1   2   3  4
0  1  2   3  34  5
1  4  5  77   2  6
2  7  8   9   4  2

In [8]:
df1.tail(3)

    0   1   2  3  4
2   7   8   9  4  2
3  56  67  23  4  6
4  87   3   5  7  5

In [9]:
df1

    0   1   2   3  4
0   1   2   3  34  5
1   4   5  77   2  6
2   7   8   9   4  2
3  56  67  23   4  6
4  87   3   5   7  5

In [10]:
df1.shape

(5, 5)

In [12]:
df1.iloc[0,1]

2

In [13]:
df1.iloc[0:2,1:3]

   1   2
0  2   3
1  5  77